# Personal & Crisp

tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "python@3.12"
brew "ansible"
brew "bash"
brew "bat"
brew "colima", restart_service: true
brew "coreutils"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "icu4c@76"
brew "harfbuzz"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "neovim"
brew "numpy"
brew "nvm"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "skaffold"
brew "sqlcmd"
brew "starship"
brew "yq"
brew "zsh-autosuggestions"
brew "jesseduffield/lazygit/lazygit"
cask "bruno"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "neovide"
cask "raycast"
cask "wezterm"

# Crisp-specific

brew "coredns", restart_service: true
tap "sdkman/tap"
brew "gradle"
brew "wireguard-tools"
brew "yarn"
